---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyAllowCutWithVoids
source: html/0071278a-bb05-0d3b-c1a1-3eee5334559c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyAllowCutWithVoids Property

"Cut with Voids When Loaded"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyAllowCutWithVoids { get; }
```